w07/d05/John_Randall/homework_smoketop-rails/app/controllers/beasts_controller.rb

SELECT "beasts".* FROM "beasts"
---
  def index
    respond_to do |format|
      format.html {
        if params[:diet]
          @diet = params[:diet]
        else
          @diet = "any"
        end

        if @diet != "any"
          @beasts = Beast.where("diet = ?", params[:diet])
        else
          @beasts = Beast.all

SELECT "beasts".* FROM "beasts" WHERE "beasts"."id" = $1 LIMIT 1  [["id", "12"]]
---
  def show
    respond_to do |format|
      format.html {
          @beasts = Beast.where("id = ?", params[:id])

DELETE FROM "beasts" WHERE "beasts"."id" = $1  [["id", 1]]
SELECT "beasts".* FROM "beasts" WHERE "beasts"."id" = $1 LIMIT 1  [["id", "1"]]
---
  def destroy
    respond_to do |format|
      Beast.find(params[:id]).destroy